Revit 2024 API
SingleServerService.SetActiveServer Method
Overload List
Name | Description
SetActiveServer(Guid)
 Set an active server applicable application-wide for the service.
SetActiveServer(Guid, Document)
 Change the active server for a specific document.
See Also
SingleServerService Class
SingleServerService Members
Autodesk.Revit.DB.ExternalService Namespace